/******************************************************************************
Практическое задание 5 05.05.2023
Старовойтова 
Вариант 22
Найти сколько раз в предложении встречается символ, введеный с клавиатуры

*******************************************************************************/

using System;
class HelloWorld {
  static void Main() {
    Console.WriteLine("Введите текст:");
    string a = Console.ReadLine();
    Console.WriteLine("Введите символ:");
    char b = Console.ReadKey().KeyChar;
    int i=0;
    foreach(char c in a)
    {
        if (c == b) {
            i++;
        }
    }
     Console.WriteLine($"Символ встречается в предложении: {i}");
  }
}


